In [1]:
import csv
import pandas as pd
import datetime as dt

In [2]:
path = "Resources/NewOrleans_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available    price
0       10291  2019-12-05         t  $314.00
1       10291  2019-12-04         t  $314.00
2       10291  2019-12-03         t  $314.00
3       10291  2019-12-02         t  $314.00
4       10291  2019-12-01         t  $314.00

In [5]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [6]:
df2.head()

   listing_id       date available    price
0       10291 2019-12-05         t  $314.00
1       10291 2019-12-04         t  $314.00
2       10291 2019-12-03         t  $314.00
3       10291 2019-12-02         t  $314.00
4       10291 2019-12-01         t  $314.00

In [7]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-29'

In [8]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
2375404    30446566 2018-12-21         t  $115.00
1385897    22332046 2018-12-21         t  $228.00
395106      9385953 2018-12-21         t  $110.00
1385770    22367529 2018-12-21         t  $228.00
1384034    22531429 2018-12-21         t  $447.00

In [9]:
df2["new_price"] = df2["price"].str.strip('$')

In [10]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

In [11]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

In [12]:
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [13]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
NewOrleans_airbnb = df3

In [14]:
NewOrleans_airbnb

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-21         97      802      1016       567       283
1  2018-12-22         70      606       849       467       251
2  2018-12-23         82      845       701       438       207
3  2018-12-24         96      833       752       431       235
4  2018-12-25         97      833       729       441       248
5  2018-12-26         95      796       757       402       204
6  2018-12-27         67      624       622       371       221
7  2018-12-28         32      229       302       369       274